Bob-the-Kuhn/bootloader_SPI/src/stm32-bootloader/bootloader.c
/**
  *******************************************************************************
  * STM32 Bootloader Source
  *******************************************************************************
  * @author Akos Pasztor
  * @file   bootloader.c
  * @brief  This file contains the functions of the bootloader. The bootloader
  *	       implementation uses the official HAL library of ST.
  *
  * @see    Please refer to README for detailed information.
  *******************************************************************************
  * @copyright (c) 2020 Akos Pasztor.                    https://akospasztor.com
  *******************************************************************************
*/

/* Includes ------------------------------------------------------------------*/
#include "bootloader.h"
#include "main.h"
#if(USE_CHECKSUM)
  #include "stm32g0xx_hal_crc.h"
#endif     
#include <string.h>  // debug
#include <stdio.h>   // debug
#include <inttypes.h>  // debug

//void kprint(const char* str);   // debug
void k_delay(const uint32_t ms);
uint32_t k_ticks(void);

void NVIC_System_Reset(void);

/* Private defines -----------------------------------------------------------*/
#define BOOTLOADER_VERSION_MAJOR 1 /*!< Major version */
#define BOOTLOADER_VERSION_MINOR 1 /*!< Minor version */
#define BOOTLOADER_VERSION_PATCH 3 /*!< Patch version */
#define BOOTLOADER_VERSION_RC    0 /*!< Release candidate version */

/* Private typedef -----------------------------------------------------------*/
typedef void (*pFunction)(void); /*!< Function pointer definition */

/* Private variables ---------------------------------------------------------*/
/** Private variable for tracking flashing progress */
static uint32_t flash_ptr = APP_ADDRESS;

uint16_t APP_first_sector = 0; // first FLASH sector an application can be loaded into
uint32_t APP_first_addr = 0;  // beginning address of first FLASH sector an application can be loaded into
uint32_t APP_sector_mask = 0xFFFFFFFF;  // mask to not affect bootloader sectors,  defaults to removing write protection from all pages 
uint32_t WRITE_protection = 0xFFFFFFFF;  // default to removing write protection from all pages 

// force the following unintialized variables into a seperate section so they don't get overwritten
// when the reset routine zeroes out the bss section       
uint32_t __attribute__((section("no_init"))) WRITE_Prot_Old_Flag;  // flag if protection was removed (in case need to restore write protection)
uint32_t __attribute__((section("no_init"))) Write_Prot_Old;
uint32_t __attribute__((section("no_init"))) wrp_old[4];  // array to hold original write protect settings
uint8_t __attribute__((section("no_init"))) wrp1a_strt;
uint8_t __attribute__((section("no_init"))) wrp1a_end;
uint8_t __attribute__((section("no_init"))) wrp2a_strt;
uint8_t __attribute__((section("no_init"))) wrp2a_end; 
uint8_t __attribute__((section("no_init"))) wrp1b_strt;
uint8_t __attribute__((section("no_init"))) wrp1b_end;
uint8_t __attribute__((section("no_init"))) wrp2b_strt;
uint8_t __attribute__((section("no_init"))) wrp2b_end; 
uint8_t __attribute__((section("no_init"))) wrp1a_strt_original;
uint8_t __attribute__((section("no_init"))) wrp1a_end_original;
uint8_t __attribute__((section("no_init"))) wrp2a_strt_original;
uint8_t __attribute__((section("no_init"))) wrp2a_end_original; 
uint8_t __attribute__((section("no_init"))) wrp1b_strt_original;
uint8_t __attribute__((section("no_init"))) wrp1b_end_original;
uint8_t __attribute__((section("no_init"))) wrp2b_strt_original;
uint8_t __attribute__((section("no_init"))) wrp2b_end_original; 
// back to normal     

uint32_t Magic_Location = Magic_BootLoader;  // flag to tell if to boot into bootloader or the application
// provide method for assembly file to access #define values
uint32_t MagicBootLoader = Magic_BootLoader;
uint32_t MagicApplication = Magic_Application;
uint32_t APP_ADDR = APP_ADDRESS;

uint8_t last_boot_page;
uint32_t app_size;



uint32_t Bank1a_prot_start;
uint32_t Bank1a_prot_end;
uint32_t Bank2a_prot_start;
uint32_t Bank2a_prot_end;
uint32_t Bank1b_prot_start;
uint32_t Bank1b_prot_end;
uint32_t Bank2b_prot_start;
uint32_t Bank2b_prot_end;

//uint32_t temp_wrp[4] = { (1 | (2 << FLASH_WRP1AR_WRP1A_END_Pos)),  (3 | (4 << FLASH_WRP1BR_WRP1B_END_Pos)), 
//                         (5 | (6 << FLASH_WRP2AR_WRP2A_END_Pos)),  (7 | (8 << FLASH_WRP2BR_WRP2B_END_Pos))};
//
uint32_t wrp_save[4]; 

char msg[64];             

/**
  * @brief  This function initializes bootloader and flash.
  * @return Bootloader error code ::eBootloaderErrorCodes
  * @retval BL_OK is returned in every case
*/
uint8_t Bootloader_Init(void)
{
  extern uint32_t _sidata[];  // end of program, start of data to be copied to RAM
  extern uint32_t _sdata[];   // start of RAM area for data
  extern uint32_t _edata[];   // end of RAM area for data
  // Read and use the linkerscript variables to determine end of bootloader in FLASH
  uint32_t boot_loader_end = (uint32_t)_sidata + (uint32_t)_edata - (uint32_t)_sdata ; 
  #define BOOT_LOADER_END boot_loader_end 
  
  /* Clear flash flags */
  HAL_FLASH_Unlock();
  __HAL_FLASH_CLEAR_FLAG(FLASH_FLAG_ALL_SR_ERRORS);
  HAL_FLASH_Lock();
  
  // STM32G0B1RE has 256 pages of 2K bytes each
  
  // 512K bytes of FLASH in two banks
  // 256 sectors/pages of 2K bytes each
  // FLASH start 0800 0000
  // bank1 - 0800 0000 - 0803 FFFF (sectors   0-127)
  // bank2 - 0804 0000 - 0807 FFFF (sectors 128-255)
  
  // Three sector/page lists:
  //   boot: 0 through last_boot_page
  //   wrp_bank1
  //   wrp_bank2
  
  
  for (uint16_t counter = 0; counter < FLASH_SIZE/FLASH_SECTOR_SIZE; counter++) {   // find 
    APP_first_addr = ((counter * FLASH_SECTOR_SIZE) + FLASH_BASE);
    if (BOOT_LOADER_END <= APP_first_addr) {
      APP_first_sector = counter; 
      break;
    }
    else {
      last_boot_page = counter;
    }
  }
  
  //sprintf(msg, "\nAPP_sector_mask %08lX\n", APP_sector_mask);
  //kprint(msg);
  // 
  //sprintf(msg, "\nBOOT_LOADER_END %08lX\n", BOOT_LOADER_END);
  //kprint(msg);
  //sprintf(msg, "Lowest possible APP_ADDRESS is %08lX\n", APP_first_addr);
  //kprint(msg);
  
  /* check APP_ADDRESS */
  if (APP_ADDRESS & 0x1ff) {
    kprint("ERROR - application address not on 512 byte boundary\n");
    Error_Handler();
  }
  if (APP_ADDRESS < APP_first_addr) {
    kprint("ERROR - application address within same sector as boot loader\n");
    Error_Handler();
  } 
  
  if (APP_OFFSET == 0) return BL_ERASE_ERROR;   // start of boot program
  if (APP_first_sector == 0) return BL_ERASE_ERROR;   // application is within same sector as bootloader
  
  wrp1a_strt = (uint8_t)(rd32(R_FLASH_WRP1AR) & 0x03ff);
  wrp1a_end  = (uint8_t)((rd32(R_FLASH_WRP1AR) >> 16) & 0x03ff);
  wrp2a_strt = (uint8_t)(rd32(R_FLASH_WRP2AR) & 0x03ff);
  wrp2a_end  = (uint8_t)((rd32(R_FLASH_WRP2AR) >> 16) & 0x03ff);
  wrp1b_strt = (uint8_t)(rd32(R_FLASH_WRP1BR) & 0x03ff);
  wrp1b_end  = (uint8_t)((rd32(R_FLASH_WRP1BR) >> 16) & 0x03ff);
  wrp2b_strt = (uint8_t)(rd32(R_FLASH_WRP2BR) & 0x03ff);
  wrp2b_end  = (uint8_t)((rd32(R_FLASH_WRP2BR) >> 16) & 0x03ff);
  
  if (wrp1a_end < wrp1a_strt) {
    Bank1a_prot_start = 0;
    Bank1a_prot_end   = 0;
  }
  else {
    Bank1a_prot_start = FLASH_BASE + (wrp1a_strt * FLASH_SECTOR_SIZE) ;
    Bank1a_prot_end   =  FLASH_BASE + ((wrp1a_end + 1) * FLASH_SECTOR_SIZE) -1; 
  }
  
  if (wrp2a_end < wrp2a_strt) {
    Bank2a_prot_start = 0;
    Bank2a_prot_end   = 0;
  }
  else {
    Bank2a_prot_start = FLASH_BASE + ((wrp2a_strt + 128) * FLASH_SECTOR_SIZE);
    Bank2a_prot_end   = FLASH_BASE + ((wrp2a_end + 128 + 1) * FLASH_SECTOR_SIZE) -1 ;
  }  
  
  
  if (wrp1b_end < wrp1b_strt) {
    Bank1b_prot_start = 0;
    Bank1b_prot_end   = 0;
  }
  else {
    Bank1b_prot_start = FLASH_BASE + (wrp1b_strt * FLASH_SECTOR_SIZE) ;
    Bank1b_prot_end   =  FLASH_BASE + ((wrp1b_end + 1) * FLASH_SECTOR_SIZE) -1; 
  }
  
