Bob-the-Kuhn/bootloader_SPI/src/stm32-bootloader/bootloader.c
  if (wrp2b_end < wrp2b_strt) {
    Bank2b_prot_start = 0;
    Bank2b_prot_end   = 0;
  }
  else {
    Bank2b_prot_start = FLASH_BASE + ((wrp2b_strt + 128) * FLASH_SECTOR_SIZE);
    Bank2b_prot_end   = FLASH_BASE + ((wrp2b_end + 128 + 1) * FLASH_SECTOR_SIZE) -1 ;
  } 
  
  return BL_OK;
}


/**
  * @brief  Erase the specified FLASH memory page.
  * @param  Banks: Banks to be erased
  *         This parameter can one of the following values:
  *            @arg FLASH_BANK_1: Bank1 to be erased
  *            @arg FLASH_BANK_2: Bank2 to be erased*
  * @param  Page FLASH page to erase
  *         This parameter must be a value between 0 and (max number of pages in Flash - 1)
  * @note (*) availability depends on devices
  * @retval None
  */
void FLASH_PageErase_(uint32_t Banks, uint32_t Page)
{
  uint32_t tmp;

  /* Get configuration register, then clear page number */
  tmp = (FLASH->CR & ~FLASH_CR_PNB);

  /* Check if page has to be erased in bank 1 or 2 */
  if (Banks != FLASH_BANK_1)
  {
    tmp |= FLASH_CR_BKER;
  }
  else
  {
    tmp &= ~FLASH_CR_BKER;
  }


  /* Set page number, Page Erase bit & Start bit */
  FLASH->CR = (tmp | (FLASH_CR_STRT | (Page <<  FLASH_CR_PNB_Pos) | FLASH_CR_PER));
}

/**
  * @brief  Perform a mass erase or erase the specified FLASH memory pages.
  * @param[in]  pEraseInit Pointer to an @ref FLASH_EraseInitTypeDef structure that
  *         contains the configuration information for the erasing.
  * @param[out]  PageError Pointer to variable that contains the configuration
  *         information on faulty page in case of error (0xFFFFFFFF means that all
  *         the pages have been correctly erased)
  * @retval HAL Status
  */
HAL_StatusTypeDef HAL_FLASHEx_Erase_(uint32_t bank, uint8_t start_page, uint8_t num_to_erase, uint32_t *PageError)
{
  HAL_StatusTypeDef status;
  uint32_t index;


  /* Wait for last operation to be completed */
  status = FLASH_WaitForLastOperation(FLASH_TIMEOUT_VALUE);

  if (status == HAL_OK)
  {

    /*Initialization of PageError variable*/
    *PageError = 0xFFFFFFFFU;

    for (index = start_page; index < (start_page + num_to_erase); index++)
    {
      /* Start erase page */
      FLASH_PageErase_(bank, index);

      /* Wait for last operation to be completed */
      status = FLASH_WaitForLastOperation(FLASH_TIMEOUT_VALUE);

      if (status != HAL_OK)
      {
        /* In case of error, stop erase procedure and return the faulty address */
        *PageError = index;
        break;
      }
    }

    /* If operation is completed or interrupted, disable the Page Erase Bit */
    CLEAR_BIT(FLASH->CR, FLASH_CR_PER);

  }


  /* return status */
  return status;
}

/**
  * @brief  This function erases the user application area in flash
  * @return Bootloader error code ::eBootloaderErrorCodes
  * @retval BL_OK: upon success
  * @retval BL_ERR: upon failure
  *
  * Each bank is erased seperately.
  * 
*/
uint8_t Bootloader_Erase(void)
{
  uint32_t PageError;
  
  uint8_t start_page = (APP_ADDRESS - FLASH_BASE)/FLASH_SECTOR_SIZE;
  uint8_t nbpages = app_size/FLASH_SECTOR_SIZE; // number full pages occupied by application
  if (app_size % FLASH_SECTOR_SIZE) nbpages++; // + 1 if have a partial page used
  
  //sprintf(msg, "start_page       : %2X\n", start_page);
  //kprint(msg);
  //sprintf(msg, "nbpages          : %2X\n", nbpages);
  //kprint(msg);
  
  uint8_t start_page_bank_1;
  uint8_t start_page_bank_2;
  uint8_t nbpages_bank_1;
  uint8_t nbpages_bank_2;
  
  if (start_page < 128) {
    start_page_bank_1 = start_page;
    if ((start_page + nbpages) <128) {  // application entirely within bank 1
      start_page_bank_2 = 0;
      nbpages_bank_1 = nbpages;
      nbpages_bank_2 = 0;
    }
    else {                              // application in both banks 1 & 2
      start_page_bank_2 = 0;
      nbpages_bank_1 = 128 - start_page;
      nbpages_bank_2 = nbpages - nbpages_bank_1 ;
    }
  }
  else {                                // application only in bank 2
    start_page_bank_1 = 0;
    nbpages_bank_1 = 0;
    start_page_bank_2 = start_page - 128;
    nbpages_bank_2 = nbpages;
  }
  
  //sprintf(msg, "start_page_bank_1: %2X\nstart_page_bank_2: %2X\n", start_page_bank_1, start_page_bank_2);
  //kprint(msg);
  //sprintf(msg, "nbpages_bank_1:    %2X\nnbpages_bank_2:    %2X\n", nbpages_bank_1, nbpages_bank_2);
  //kprint(msg);
  
  HAL_FLASH_Unlock();  
  
  LED_G1_ON(); 
  LED_G2_OFF();
  
  #define FLASH_INCR 25  // number of pages to erase before reporting status
  uint8_t num_to_erase;
  
  if (nbpages_bank_1) {
    for (uint16_t count = 0; count <= nbpages_bank_1; count += FLASH_INCR) {
      num_to_erase = ((count + FLASH_INCR) < nbpages_bank_1) ? FLASH_INCR : (nbpages_bank_1 - count + 1); // number pages to erase this loop
      sprintf(msg, "Erasing bank 1, page: %02X\n", start_page_bank_1 + count);
      LED_ALL_TG();
      kprint(msg);
      HAL_StatusTypeDef status = HAL_FLASHEx_Erase_(FLASH_BANK_1, start_page_bank_1 + count, num_to_erase, &PageError);
      //uint32_t* flash_addr = (uint32_t *)(((start_page_bank_1 + count) *FLASH_SECTOR_SIZE) + FLASH_BASE);
      //uint32_t flash_data = *flash_addr; // read first word of just erased page
      //sprintf(msg, "count: %02X  flash_addr: %08lX  flash_data: %08lX\n", count, flash_addr, flash_data);
      //kprint(msg);
      //sprintf(msg, " num pages erased:   %02X\n",  num_to_erase);
      //kprint(msg);
      
      if ((status != HAL_OK) | (PageError != 0xFFFFFFFF)) {
        sprintf(msg, "ERROR: status:    %u\n", status);
        kprint(msg);
        sprintf(msg, "ERROR: PageError: %08lX\n", PageError);
        kprint(msg);
      }
    }
  }
  
  if (nbpages_bank_2) {
    for (uint16_t count = 0; count <= nbpages_bank_2; count += FLASH_INCR) {
      num_to_erase = ((count + FLASH_INCR) < nbpages_bank_2) ? FLASH_INCR : (nbpages_bank_2 - count + 1); // number pages to erase this loop
      sprintf(msg, "Erasing bank 2, page: %u\n", start_page_bank_2 + count);
      LED_ALL_TG();
      kprint(msg);
      HAL_StatusTypeDef status = HAL_FLASHEx_Erase_(FLASH_BANK_2, start_page_bank_2 + count, num_to_erase, &PageError);
      if ((status != HAL_OK) | (PageError != 0xFFFFFFFF)) {
        sprintf(msg, "ERROR: status:    %u\n", status);
        kprint(msg);
        sprintf(msg, "ERROR: PageError: %08lX\n", PageError);
        kprint(msg);
      }
    }
  }
  
  HAL_FLASH_Lock();                 
  return (PageError == 0xFFFFFFFF) ? BL_OK : BL_ERASE_ERROR;
}

/**
  * @brief  Begin flash programming: this function unlocks the flash and sets
  *         the data pointer to the start of application flash area.
  * @see    README for futher information
  * @return Bootloader error code ::eBootloaderErrorCodes
  * @retval BL_OK is returned in every case
*/
uint8_t Bootloader_FlashBegin(void)
{
  /* Reset flash destination address */
  flash_ptr = APP_ADDRESS;
  
  /* Unlock flash */
  HAL_FLASH_Unlock();
  __HAL_FLASH_CLEAR_FLAG(FLASH_SR_EOP | FLASH_SR_WRPERR | FLASH_SR_PROGERR);
  
  return BL_OK;
}

/**
  * @brief  Program 16 bit data into flash: this function writes an 2 byte (16 bit)
  *         data chunk into the flash and increments the data pointer.
  * @see    README for futher information
  * @param  data: pointer to buffer with data to be written into flash
  buffer needs to be 16 bit word aligned to match FLASH writes
  count: number of bytes in the buffer
  * @return Bootloader error code ::eBootloaderErrorCodes
  * @retval BL_OK: upon success
  * @retval BL_WRITE_ERROR: upon failure
*/
uint8_t Bootloader_FlashNext_Buf(uint8_t *data, UINT count)
{
  if(!(flash_ptr <= (FLASH_BASE + FLASH_SIZE - count)) ||
  (flash_ptr < APP_ADDRESS))
  {
    HAL_FLASH_Lock();
    return BL_WRITE_ERROR;
  }
  
  uint16_t read_data;
  uint16_t data_16;
  uint16_t i;
  for (i = 0; i < count/2; i++) {
    data_16 = (uint16_t) (*data  + (*(data+1) << 8));  // assemble two bytes
    SET_BIT(FLASH->CR, FLASH_CR_PG);  // tell FLASH controller we'll be writing to FLASH
    *(__IO uint16_t*)flash_ptr = data_16;
    read_data = *(uint16_t*)flash_ptr;
    if (read_data != data_16)            
    {
      /* Flash content doesn't match source content */
      HAL_FLASH_Lock();
      kprint("Programming error\n");
      sprintf(msg, "expected data (16 bit): %04X\n", data_16);
      kprint(msg);   
      sprintf(msg, "actual data (16 bit)  : %04X\n", read_data);
      kprint(msg);   
      sprintf(msg, "absolute address (byte): %08lX\n", flash_ptr);
      kprint(msg);
      
      HAL_FLASH_Lock();
      return BL_WRITE_ERROR;
    }
    flash_ptr += 2;
    data += 2;
  } 
  
  if (count%2) {  // have an odd number of bytes - need to pad it out & write it - this will only happen at the end of the file
    data_16 = ((*data << 8) + *(data+1));  // assemble two bytes into a
    SET_BIT(FLASH->CR, FLASH_CR_PG);  // tell FLASH controller we'll be writing to FLASH
    *(__IO uint16_t*)flash_ptr = data_16;
    read_data = *(uint16_t*)flash_ptr;
    if(read_data != data_16)            
    {
      /* Flash content doesn't match source content */
      HAL_FLASH_Lock();
      kprint("Programming error\n");
      sprintf(msg, "expected data (16 bit): %04X\n", data_16);
      kprint(msg);   
      sprintf(msg, "actual data (16 bit)  : %04X\n", read_data);
      kprint(msg);   
      sprintf(msg, "absolute address (byte): %08lX\n", flash_ptr);
      kprint(msg);
      
      HAL_FLASH_Lock();
      return BL_WRITE_ERROR;
    }
  }
  
  if (FLASH->SR & (FLASH_SR_WRPERR | FLASH_SR_PROGERR)) return BL_WRITE_ERROR;
  
  HAL_FLASH_Lock();
  return BL_OK;
}


/**
  * @brief  Wait for a FLASH operation to complete.
  * @param  Timeout maximum flash operation timeout
  * @retval HAL_StatusTypeDef HAL Status
  */
HAL_StatusTypeDef FLASH_WaitForLastOperation_(uint32_t Timeout)
{
  uint32_t error;
  /* Wait for the FLASH operation to complete by polling on BUSY flag to be reset.
     Even if the FLASH operation fails, the BUSY flag will be reset and an error
     flag will be set */
  uint32_t timeout = k_ticks() + Timeout;

  /* Wait if any operation is ongoing */
#if defined(FLASH_DBANK_SUPPORT)
  error = (FLASH_SR_BSY1 | FLASH_SR_BSY2);
#else
  error = FLASH_SR_BSY1;
#endif /* FLASH_DBANK_SUPPORT */

  while ((FLASH->SR & error) != 0x00U)
  {
    if (k_ticks() >= timeout)
    {
      return HAL_TIMEOUT;
    }
  }

  /* check flash errors */
  error = (FLASH->SR & FLASH_SR_ERRORS);

  /* Clear SR register */
  FLASH->SR = FLASH_SR_CLEAR;

