Bob-the-Kuhn/bootloader_SPI/src/stm32-bootloader/bootloader.c
// debug helper routine
const char *byte_to_binary (uint32_t x)
{
  static char b[33];
  b[0] = '\0';
  
  uint32_t z;
  for (z = 1 << 31; z > 0; z >>= 1)
  {
    strcat(b, ((x & z) == z) ? "1" : "0");
  }
  
  return b;
}


/**
  * @brief  This function configures the write protection of flash.
  * @param  protection: protection type ::eFlashProtectionTypes
  * @retval BL_OK: 
  
  *
  * Setting the protection is a five step process
  *   1) Determine final proection
  *   2) Disable protection on desired sectors
  *   3) Enable protection on all other sectors
  *   4) Invoke HAL_FLASH_OB_Launch()
  *   5) Send the system through reset so that the new settings take effect
  * 
*/

uint8_t Bootloader_ConfigProtection_Set(uint32_t *data) {  
  /*           @arg @ref OB_WRPAREA_ZONE_A Flash Zone A
    *           @arg @ref OB_WRPAREA_ZONE_B Flash Zone B
    *           @arg @ref OB_WRPAREA_ZONE2_A Flash Bank 2 Zone A (*)
    *           @arg @ref OB_WRPAREA_ZONE2_B Flash Bank 2 Zone B (*)
    * @note  (*) availability depends on devices
    * @param  WRPStartOffset  Specifies the start page of the write protected area
    *         This parameter can be page number between 0 and (max number of pages in the Flash Bank - 1)
    * @param  WRDPEndOffset  Specifies the end page of the write protected area
    *         This parameter can be page number between WRPStartOffset and (max number of pages in the Flash Bank - 1)
    * @retval None
  */
  //FLASH_OB_WRPConfig(OB_WRPAREA_ZONE_A, 5, 20);
  //FLASH_OB_WRPConfig(OB_WRPAREA_ZONE_B, 45, 90);
  
  //FLASH_OBProgramInitTypeDef pOBInit ={0};
  //HAL_FLASHEx_OBGetConfig(&pOBInit);
  //
  //pOBInit.OptionType = OPTIONBYTE_WRP;
  //pOBInit.WRPArea = OB_WRPAREA_ZONE_A; // OB_WRPAREA_ZONE_A, OB_WRPAREA_ZONE_B , OB_WRPAREA_ZONE2_A, OB_WRPAREA_ZONE2_B
  //pOBInit.WRPStartOffset = 0x7f;  //  zero based sector/page number
  //pOBInit.WRPEndOffset = 0; 
  
  HAL_FLASH_Unlock();
  HAL_FLASH_OB_Unlock();
  while( rd32(R_FLASH_SR) & FLASH_SR_BSY1);  // wait until BSY1 is inactive before programming
  
  // #define FLASH_WRP_START_MSK 0x7F
  // #define FLASH_WRP_END_MSK   (0x7F << 16)
  // 
  //and32(R_FLASH_WRP1AR, ~(FLASH_WRP_START_MSK | FLASH_WRP_END_MSK));          // clear out start & end bits (but leave others unaffected)
  //or32(R_FLASH_WRP1AR , data[0] & (FLASH_WRP_START_MSK | FLASH_WRP_END_MSK)); // write new start & end bits (but leave others unaffected)
  //and32(R_FLASH_WRP1BR , ~(FLASH_WRP_START_MSK | FLASH_WRP_END_MSK));         // clear out start & end bits (but leave others unaffected)
  //or32(R_FLASH_WRP1BR , data[1] & (FLASH_WRP_START_MSK | FLASH_WRP_END_MSK)); // write new start & end bits (but leave others unaffected)
  //and32(R_FLASH_WRP2AR , ~(FLASH_WRP_START_MSK | FLASH_WRP_END_MSK));         // clear out start & end bits (but leave others unaffected)
  //or32(R_FLASH_WRP2AR , data[2] & (FLASH_WRP_START_MSK | FLASH_WRP_END_MSK)); // write new start & end bits (but leave others unaffected)
  //and32(R_FLASH_WRP2BR , ~(FLASH_WRP_START_MSK | FLASH_WRP_END_MSK));         // clear out start & end bits (but leave others unaffected)
  //or32(R_FLASH_WRP2BR , data[3] & (FLASH_WRP_START_MSK | FLASH_WRP_END_MSK)); // write new start & end bits (but leave others unaffected)
  
  //and32(R_FLASH_WRP1AR, ~(FLASH_WRP1AR_WRP1A_STRT | FLASH_WRP1AR_WRP1A_END));          // clear out start & end bits (but leave others unaffected)
  //or32(R_FLASH_WRP1AR , data[0] & (FLASH_WRP1AR_WRP1A_STRT | FLASH_WRP1AR_WRP1A_END)); // write new start & end bits (but leave others unaffected)
  //and32(R_FLASH_WRP1BR , ~(FLASH_WRP1BR_WRP1B_STRT | FLASH_WRP1BR_WRP1B_END));          // clear out start & end bits (but leave others unaffected)
  //or32(R_FLASH_WRP1BR , data[1] & (FLASH_WRP1BR_WRP1B_STRT | FLASH_WRP1BR_WRP1B_END)); // write new start & end bits (but leave others unaffected)
  //and32(R_FLASH_WRP2AR , ~(FLASH_WRP2AR_WRP2A_STRT | FLASH_WRP2AR_WRP2A_END));          // clear out start & end bits (but leave others unaffected)
  //or32(R_FLASH_WRP2AR , data[2] & (FLASH_WRP2AR_WRP2A_STRT | FLASH_WRP2AR_WRP2A_END)); // write new start & end bits (but leave others unaffected)
  //and32(R_FLASH_WRP2BR , ~(FLASH_WRP2BR_WRP2B_STRT | FLASH_WRP2BR_WRP2B_END));          // clear out start & end bits (but leave others unaffected)
  //or32(R_FLASH_WRP2BR , data[3] & (FLASH_WRP2BR_WRP2B_STRT | FLASH_WRP2BR_WRP2B_END)); // write new start & end bits (but leave others unaffected)
  
  // TRY 16 BIT ACCESS
  
  //and16(R_FLASH_WRP1AR_STRT, (uint16_t)~(FLASH_WRP1AR_WRP1A_STRT));                    // clear out start bits (but leave others unaffected)
  //or16(R_FLASH_WRP1AR_STRT , (uint16_t)(data[0] & (FLASH_WRP1AR_WRP1A_STRT)));         // write new start bits (but leave others unaffected)
  //and16(R_FLASH_WRP1BR_STRT , (uint16_t)~(FLASH_WRP1BR_WRP1B_STRT ));                  // clear out start bits (but leave others unaffected)
  //or16(R_FLASH_WRP1BR_STRT , (uint16_t)(data[1] & (FLASH_WRP1BR_WRP1B_STRT)));         // write new start bits (but leave others unaffected)
  //and16(R_FLASH_WRP2AR_STRT , (uint16_t)~(FLASH_WRP2AR_WRP2A_STRT));                   // clear out start bits (but leave others unaffected)
  //or16(R_FLASH_WRP2AR_STRT , (uint16_t)(data[2] & (FLASH_WRP2AR_WRP2A_STRT)));         // write new start bits (but leave others unaffected)
  //and16(R_FLASH_WRP2BR_STRT , (uint16_t)~(FLASH_WRP2BR_WRP2B_STRT));                   // clear out start bits (but leave others unaffected)
  //or16(R_FLASH_WRP2BR_STRT , (uint16_t)(data[3] & (FLASH_WRP2BR_WRP2B_STRT)));         // write new start bits (but leave others unaffected)
  
  // wr16(R_FLASH_WRP1AR_STRT , (uint16_t)(data[0] & (FLASH_WRP1AR_WRP1A_STRT)));         // write new start bits (but leave others unaffected)
  // wr16(R_FLASH_WRP1BR_STRT , (uint16_t)(data[1] & (FLASH_WRP1BR_WRP1B_STRT)));         // write new start bits (but leave others unaffected)
  // wr16(R_FLASH_WRP2AR_STRT , (uint16_t)(data[2] & (FLASH_WRP2AR_WRP2A_STRT)));         // write new start bits (but leave others unaffected)
  // wr16(R_FLASH_WRP2BR_STRT , (uint16_t)(data[3] & (FLASH_WRP2BR_WRP2B_STRT)));         // write new start bits (but leave others unaffected)
  
  //FLASH->WRP1AR = 0;  // neither changed
  // works!
  uint8_t* wrp1ar_strt_ptr = (uint8_t*)0x4002202C;
  uint8_t* wrp1ar_end_ptr  = (uint8_t*)0x4002202E;
  uint8_t* wrp1br_strt_ptr = (uint8_t*)0x40022030;
  uint8_t* wrp1br_end_ptr  = (uint8_t*)0x40022032;
  uint8_t* wrp2ar_strt_ptr = (uint8_t*)0x4002204C;
  uint8_t* wrp2ar_end_ptr  = (uint8_t*)0x4002204E;
  uint8_t* wrp2br_strt_ptr = (uint8_t*)0x40022050;
  uint8_t* wrp2br_end_ptr  = (uint8_t*)0x40022052;
  
  #define FLASH_WRP_MSK 0x0000007F   
  
  *wrp1ar_strt_ptr = (uint8_t)(data[0] & FLASH_WRP_MSK); 
  *wrp1ar_end_ptr  = (uint8_t)((data[0] >> 16) & FLASH_WRP_MSK); 
  *wrp1br_strt_ptr = (uint8_t)(data[1] & FLASH_WRP_MSK); 
  *wrp1br_end_ptr  = (uint8_t)((data[1] >> 16) & FLASH_WRP_MSK);
  *wrp2ar_strt_ptr = (uint8_t)(data[2] & FLASH_WRP_MSK); 
  *wrp2ar_end_ptr  = (uint8_t)((data[2] >> 16) & FLASH_WRP_MSK);
  *wrp2br_strt_ptr = (uint8_t)(data[3] & FLASH_WRP_MSK); 
  *wrp2br_end_ptr  = (uint8_t)((data[3] >> 16) & FLASH_WRP_MSK);
  
  
  //FLASH_OBProgramInitTypeDef pOBInit ={0};
  //HAL_FLASHEx_OBGetConfig(&pOBInit);
  //
  //pOBInit.OptionType = OPTIONBYTE_WRP;
  //pOBInit.WRPArea = OB_WRPAREA_ZONE_A; // OB_WRPAREA_ZONE_A, OB_WRPAREA_ZONE_B , OB_WRPAREA_ZONE2_A, OB_WRPAREA_ZONE2_B
  //pOBInit.WRPStartOffset = 0x2;  //  zero based sector/page number
  //pOBInit.WRPEndOffset = 0x4; 
  //
  //HAL_FLASHEx_OBProgram(&pOBInit);
  //
  or32(R_FLASH_CR , FLASH_CR_OPTSTRT);   //starts option byte programming
  while( rd32(R_FLASH_SR) & FLASH_SR_BSY1);  // wait until BSY1 is inactive
  or32(R_FLASH_CR , FLASH_CR_OBL_LAUNCH);  //sends system through reset which makes the new option bytes active.
  HAL_FLASH_OB_Lock();   // should never be executed
  HAL_FLASH_Lock();   // should never be executed
  
  return BL_OK;
}

void Bootloader_ConfigProtection_Save(uint32_t *data) {  
  /*           @arg @ref OB_WRPAREA_ZONE_A Flash Zone A
    *           @arg @ref OB_WRPAREA_ZONE_B Flash Zone B
    *           @arg @ref OB_WRPAREA_ZONE2_A Flash Bank 2 Zone A (*)
    *           @arg @ref OB_WRPAREA_ZONE2_B Flash Bank 2 Zone B (*)
    * @note  (*) availability depends on devices
    * @param  WRPStartOffset  Specifies the start page of the write protected area
    *         This parameter can be page number between 0 and (max number of pages in the Flash Bank - 1)
    * @param  WRDPEndOffset  Specifies the end page of the write protected area
    *         This parameter can be page number between WRPStartOffset and (max number of pages in the Flash Bank - 1)
    * @retval None
  */
  
  data[0] = rd32(R_FLASH_WRP1AR);
  data[1] = rd32(R_FLASH_WRP1BR);
  data[2] = rd32(R_FLASH_WRP2AR);
  data[3] = rd32(R_FLASH_WRP2BR);
  
