Bob-the-Kuhn/bootloader_SPI/src/stm32-bootloader/bootloader.c
}

void Bootloader_ConfigProtection_Clear(uint32_t *data) {  
  
  data[0] = 0x0000007F; // start > end so no protection
  data[1] = 0x0000007F; // start > end so no protection
  data[2] = 0x0000007F; // start > end so no protection
  data[3] = 0x0000007F; // start > end so no protection
  
}


// remove protection from application area
// protection of area before application is not changed
// protection of area beyond application not changed
//
// always returns success
uint8_t Bootloader_ConfigProtection_Keep_Boot(void) {  
  
  #define WITHIN(N,L,H)       ((N) >= (L) && (N) <= (H))
  uint32_t temp_wrp[4] = {0};
  
  if (app_size) {
    
    uint8_t first_app_page = (APP_ADDRESS - FLASH_BASE)/ FLASH_SECTOR_SIZE;
    uint8_t last_app_page = ((app_size/FLASH_SECTOR_SIZE) + first_app_page);
    if (app_size % FLASH_SECTOR_SIZE) last_app_page++;  // include partial page
    
    if (wrp1a_end >= wrp1a_strt) {
      // CASE A - wrp1a starts in app area
      if (WITHIN(wrp1a_strt, first_app_page, last_app_page)) {
        if ( wrp1a_end <= last_app_page) {  
          // CASE A1 - wrp1a entirely within application area
          temp_wrp[0] = 0x0000007F;         // disable wrp1a (set last < start)
        }
        else {
          // CASE A2 - wrp1a extends beyond application
          temp_wrp[0] = (last_app_page | (wrp1a_end << 16));  // application is partially within wrp1a
        }
      }  
      // CASE B - wrp1a starts before application
      else if (WITHIN(wrp1a_strt, 0, first_app_page -1)) {
        if (WITHIN(wrp1a_end, 0, first_app_page -1)) {
          // CASE B1 - wrp1a entirely before application area
          //temp_wrp[0] = rd32(R_FLASH_WRP1AR);  // no change to wrp1a
          temp_wrp[0] = (wrp1a_strt | (wrp1a_end << 16));   // no change to wrp1a
        }
        else {
          // CASE B2 - wrp1a starts before application area but extends into application area
          temp_wrp[0] = wrp1a_strt | ((first_app_page - 1) << 16);  // wrp1a end to end of area before application
        }
      }
      else {
        // CASE C - wrp1a starts beyond the application so no changes needed
        //temp_wrp[0] = rd32(R_FLASH_WRP1AR);  // no change to wrp1a
        temp_wrp[0] = (wrp1a_strt | (wrp1a_end << 16));   // no change to wrp1a
      }
    }  // end wrp1a
    
    
    if (wrp1b_end >= wrp1b_strt) {
      // CASE A - wrp1b starts in app area
      if (WITHIN(wrp1b_strt, first_app_page, last_app_page)) {
        if ( wrp1b_end <= last_app_page) {  
          // CASE A1 - wrp1b entirely within application area
          temp_wrp[1] = 0x0000007F;         // disable wrp1b (set last < start)
        }
        else {
          // CASE A2 - wrp1b extends beyond application
          temp_wrp[1] = (last_app_page | (wrp1b_end << 16));  // application is partially within wrp1b
        }
      }  
      // CASE B - wrp1b starts before application
      else if (WITHIN(wrp1b_strt, 0, first_app_page -1)) {
        if (WITHIN(wrp1b_end, 0, first_app_page -1)) {
          // CASE B1 - wrp1b entirely before application area
          //temp_wrp[1] = rd32(R_FLASH_WRP1BR);  // no change to wrp1b
          temp_wrp[1] = (wrp1b_strt | (wrp1b_end << 16));   // no change to wrp1b
        }
        else {
          // CASE B2 - wrp1b starts before application area but extends into application area
          temp_wrp[1] = wrp1b_strt | ((first_app_page - 1) << 16);  // wrp1b end to end of area before application
        }
      }
      else {
        // CASE C - wrp1b starts beyond the application so no changes needed
        //temp_wrp[1] = rd32(R_FLASH_WRP1BR);  // no change to wrp1b
        temp_wrp[1] = (wrp1b_strt | (wrp1b_end << 16));   // no change to wrp1b
      }
    }  // end wrp1b
    
    
    if (wrp2a_end >= wrp2a_strt) {
      // CASE A - wrp2a starts in app area
      if (WITHIN(wrp2a_strt + 128, first_app_page, last_app_page)) {
        if ( wrp2a_end + 128 <= last_app_page) {  
          // CASE A1 - wrp2a entirely within application area
          temp_wrp[2] = 0x0000007F;         // disable wrp2a (set last < start)
        }
        else {
          // CASE A2 - wrp2a extends beyond application
          temp_wrp[2] = ((last_app_page - 128) | (wrp2a_end << 16));  // application is partially within wrp2a
        }
      }  
      // CASE B - wrp2a starts before application
      else if (WITHIN(wrp2a_strt + 128, 0, first_app_page -1)) {
        if (WITHIN(wrp2a_end + 128, 0, first_app_page -1)) {
          // CASE B1 - wrp2a entirely before application area
          //temp_wrp[2] = rd32(R_FLASH_WRP2AR);  // no change to wrp2a
          temp_wrp[2] = (wrp2a_strt | (wrp2a_end << 16));   // no change to wrp2a
        }
        else {
          // CASE B2 - wrp2a starts before application area but extends into application area
          temp_wrp[2] = wrp2a_strt | ((first_app_page - 1 - 128) << 16);  // wrp2a end to end of area before application
        }
      }
      else {
        // CASE C - wrp2a starts beyond the application so no changes needed
        //temp_wrp[2] = rd32(R_FLASH_WRP2AR);  // no change to wrp2a
        temp_wrp[2] = (wrp2a_strt | (wrp2a_end << 16));   // no change to wrp2a
      }
    }  // end wrp2a 
    
    
    if (wrp2b_end >= wrp2b_strt) {
      // CASE A - wrp2b starts in app area
      if (WITHIN(wrp2b_strt + 128, first_app_page, last_app_page)) {
        if ( wrp2b_end + 128 <= last_app_page) {  
          // CASE A1 - wrp2b entirely within application area
          temp_wrp[3] = 0x0000007F;         // disable wrp2b (set last < start)
        }
        else {
          // CASE A2 - wrp2b extends beyond application
          temp_wrp[3] = ((last_app_page - 128) | (wrp2b_end << 16));  // application is partially within wrp2b
        }
      }  
      // CASE B - wrp2b starts before application
      else if (WITHIN(wrp2b_strt + 128, 0, first_app_page -1)) {
        if (WITHIN(wrp2b_end + 128, 0, first_app_page -1)) {
          // CASE B1 - wrp2b entirely before application area
          //temp_wrp[3] = rd32(R_FLASH_WRP2BR);  // no change to wrp2b
          temp_wrp[3] = (wrp2b_strt | (wrp2b_end << 16));   // no change to wrp2a
        }
        else {
          // CASE B2 - wrp2b starts before application area but extends into application area
          temp_wrp[3] = wrp2b_strt | ((first_app_page - 1 - 128) << 16);  // wrp2b end to end of area before application
        }
      }
      else {
        // CASE C - wrp2b starts beyond the application so no changes needed
         //temp_wrp[3] = rd32(R_FLASH_WRP2BR);  // no change to wrp2b
        temp_wrp[3] = (wrp2b_strt | (wrp2b_end << 16));   // no change to wrp2a
      }
    }  // end wrp2b 
    
    Bootloader_ConfigProtection_Set(temp_wrp);   // update wrp
    
    kprint("Keep_Boot:  should never see this\n");   
    
  }  // app size
  return HAL_OK;
}



void save_WRP_state(void) {
  WRITE_Prot_Old_Flag = WRITE_Prot_Original_flag;  // flag that protection was saved
  Bootloader_ConfigProtection_Save(wrp_old);  // save the current write protection
  //sprintf(msg, "saved wrp_old[0] (wrp1a): %08lX\n", wrp_old[0]);
  //kprint(msg);                    
  //sprintf(msg, "saved wrp_old[1] (wrp1b): %08lX\n", wrp_old[1]);
  //kprint(msg);                    
  //sprintf(msg, "saved wrp_old[2] (wrp2a): %08lX\n", wrp_old[2]);
  //kprint(msg);                    
  //sprintf(msg, "saved wrp_old[3] (wrp2b): %08lX\n", wrp_old[3]);
  //kprint(msg);
}

void report_WP_ConfigProtection(void)
{
  
  if (wrp1a_end < wrp1a_strt) {
    kprint("BANK1 area A protection: none\n");
  }
  else {
    sprintf(msg,"BANK1 area A protection: %08lX", Bank1a_prot_start);
    kprint(msg);
    sprintf(msg," - %08lX\n", Bank1a_prot_end);
    kprint(msg);
  }
  
  if (wrp1b_end < wrp1b_strt) {
    kprint("BANK1 area B protection: none\n");
  }
  else {
    sprintf(msg,"BANK1 area B protection: %08lX", Bank1b_prot_start);
    kprint(msg);
    sprintf(msg," - %08lX\n", Bank1b_prot_end);
    kprint(msg);
  }
  
  if (wrp2a_end < wrp2a_strt) {
    kprint("BANK2 area A protection: none\n");
  }
  else {
    sprintf(msg,"BANK2 area A protection: %08lX", Bank2a_prot_start );
    kprint(msg);
    sprintf(msg," - %08lX\n", Bank2a_prot_end);
    kprint(msg);
  }  
  
