Bob-the-Kuhn/bootloader_SPI/src/stm32-bootloader/bootloader.c
  if (wrp2b_end < wrp2b_strt) {
    kprint("BANK2 area B protection: none\n");
  }
  else {
    sprintf(msg,"BANK2 area B protection: %08lX", Bank2b_prot_start );
    kprint(msg);
    sprintf(msg," - %08lX\n", Bank2b_prot_end);
    kprint(msg);
  }  
  sprintf(msg, "wrp1a: %08lX\n", rd32(R_FLASH_WRP1AR) );
  kprint(msg); 
  sprintf(msg, "wrp1b: %08lX\n", rd32(R_FLASH_WRP1BR) );
  kprint(msg);                   
  sprintf(msg, "wrp2a: %08lX\n", rd32(R_FLASH_WRP2AR) );
  kprint(msg);
  sprintf(msg, "wrp2b: %08lX\n", rd32(R_FLASH_WRP2BR) );
  kprint(msg);
  
  sprintf(msg, "      wrp_old[0] (wrp1a): %08lX\n", wrp_old[0]);
  kprint(msg);       
  sprintf(msg, "      wrp_old[1] (wrp1b): %08lX\n", wrp_old[1]);
  kprint(msg);       
  sprintf(msg, "      wrp_old[2] (wrp2a): %08lX\n", wrp_old[2]);
  kprint(msg);       
  sprintf(msg, "      wrp_old[3] (wrp2b): %08lX\n", wrp_old[3]);
  kprint(msg);
  
}

/**
  * @brief  This function checks whether the new application fits into flash.
  * @param  appsize: size of application
  * @return Bootloader error code ::eBootloaderErrorCodes
  * @retval BL_OK: if application fits into flash
  * @retval BL_SIZE_ERROR: if application does not fit into flash
*/
uint8_t Bootloader_CheckSize(uint32_t appsize)
{
  
 //sprintf(msg, "APP size: %8lX\n", appsize);
 //kprint(msg);
  
  return ((FLASH_BASE + FLASH_SIZE - APP_ADDRESS) >= appsize) ? BL_OK
  : BL_SIZE_ERROR;
}

/**
  * @brief  This function verifies the checksum of application located in flash.
  *         If ::USE_CHECKSUM configuration parameter is disabled then the
  *         function always returns an error code.
  * @return Bootloader error code ::eBootloaderErrorCodes
  * @retval BL_OK: if calculated checksum matches the application checksum
  * @retval BL_CHKS_ERROR: upon checksum mismatch or when ::USE_CHECKSUM is
  *         disabled
*/
uint8_t Bootloader_VerifyChecksum(void)
{
  #if(USE_CHECKSUM)
    CRC_HandleTypeDef CrcHandle;
    volatile uint32_t calculatedCrc = 0;
    
    __HAL_RCC_CRC_CLK_ENABLE();
    CrcHandle.Instance                     = CRC;
    CrcHandle.Init.DefaultPolynomialUse    = DEFAULT_POLYNOMIAL_ENABLE;
    CrcHandle.Init.DefaultInitValueUse     = DEFAULT_INIT_VALUE_ENABLE;
    CrcHandle.Init.InputDataInversionMode  = CRC_INPUTDATA_INVERSION_NONE;
    CrcHandle.Init.OutputDataInversionMode = CRC_OUTPUTDATA_INVERSION_DISABLE;
    CrcHandle.InputDataFormat              = CRC_INPUTDATA_FORMAT_WORDS;
    if(HAL_CRC_Init(&CrcHandle) != HAL_OK)
    {
      return BL_CHKS_ERROR;
    }
    
    calculatedCrc =
    HAL_CRC_Calculate(&CrcHandle, (uint32_t*)APP_ADDRESS, APP_SIZE);
    
    __HAL_RCC_CRC_FORCE_RESET();
    __HAL_RCC_CRC_RELEASE_RESET();
    
    if((*(uint32_t*)CRC_ADDRESS) == calculatedCrc)
    {
      return BL_OK;
    }
  #endif
  return BL_CHKS_ERROR;
}

/**
  * @brief  This function checks whether a valid application exists in flash.
  *         The check is performed by checking the very first DWORD (4 bytes) of
  *         the application firmware. In case of a valid application, this DWORD
  *         must represent the initialization location of stack pointer - which
  *         must be within the boundaries of RAM.
  * @return Bootloader error code ::eBootloaderErrorCodes
  * @retval BL_OK: if first DWORD represents a valid stack pointer location
  * @retval BL_NO_APP: first DWORD value is out of RAM boundaries
*/
uint8_t Bootloader_CheckForApplication(void)
{
  return ((((*(uint32_t*)APP_ADDRESS) - RAM_BASE) <= RAM_SIZE) ? BL_OK : BL_NO_APP);
  
}


/**
  * @brief  This function performs the jump to the user application in flash.
  * @details The function carries out the following operations:
  *  - Sets the flag that we should load application after the next reset
  *  - Sends the card through reset
  *  
  *  The reset handler checks this flag and will either continue to start the
  *  bootloader or it will start the application.
*/

void Bootloader_JumpToApplication(void) {
  
  Magic_Location = Magic_Application;  // flag that we should load application 
  // after the next reset
  NVIC_System_Reset();                  // send the system through reset
}


/**
  * @brief  This function returns the version number of the bootloader library.
  *         Semantic versioning is used for numbering.
  * @see    Semantic versioning: https://semver.org
  * @return Bootloader version number combined into an uint32_t:
  *          - [31:24] Major version
  *          - [23:16] Minor version
  *          - [15:8]  Patch version
  *          - [7:0]   Release candidate version
*/
//uint32_t Bootloader_GetVersion(void)
//{
//    return ((BOOTLOADER_VERSION_MAJOR << 24) |
//            (BOOTLOADER_VERSION_MINOR << 16) | (BOOTLOADER_VERSION_PATCH << 8) |
//            (BOOTLOADER_VERSION_RC));
//}


/**
  \brief   System Reset
  \details Initiates a system reset request to reset the MCU.
*/
void NVIC_System_Reset(void)
{
  #define SCB_AIRCR_VECTKEY_Pos 16U   /*!< SCB AIRCR: VECTKEY Position */
  #define SCB_AIRCR_SYSRESETREQ_Pos 2U   /*!< SCB AIRCR: VECTKEY Position */
  volatile uint32_t* SCB_AIRCR = (uint32_t*)0xE000ED0CUL;  
  
  *SCB_AIRCR = (uint32_t)(((0x5FAUL << SCB_AIRCR_VECTKEY_Pos) | (1 << SCB_AIRCR_SYSRESETREQ_Pos)));
  
  for(;;)                                                           /* wait until reset */
  {
  }
}
